Repository: SubhadeepJasu/pebbles
Catalog: po/*.po
Languages: ru

source: Open In Mini Mode
ru: Открыть в уменьшенном виде

source: Open A New Window
ru: Открыть новое окно

source: Enable test mode
ru: Включить режим тестирования

source: All Categories
ru: Все категории

source: Pebbles Menu
ru: Меню Pebbles

source: Degrees
ru: Градусы

source: Radians
ru: Радианы

source: Shift
ru: Сдвиг

source: AGE
ru: Время

source: DUR
ru: Длит.

source: ADD
ru: Вперёд

source: SUB
ru: Назад

source: Qword
ru: Четверное число

source: Dword
ru: Двойное число

source: Update Forex Data
ru: Обновить данные Forex

source: Updates automatically every 10 minutes
ru: Обновляется автоматически каждые 10 минут

source: Last updated on
ru: Последнее обновление:

source: Show Controls
ru: Сочетания клавиш

source: Preferences
ru: Параметры

source: History
ru: История

source: Show Calculation History
ru: Показать историю вычислений

source: Scientific
ru: Инженерный

source: Calculus
ru: Математический

source: Programmer
ru: Программист

source: Date
ru: Вычисление даты

source: Statistics
ru: Статистический

source: Financial
ru: Финансовый

source: Length
ru: Длина

source: Area
ru: Площадь

source: Volume
ru: Объём

source: Time
ru: Время

source: Angle
ru: Угол

source: Speed
ru: Скорость

source: Mass
ru: Масса

source: Pressure
ru: Давление

source: Energy
ru: Энергия

source: Power
ru: Мощность

source: Temperature
ru: Температура

source: Data
ru: Данные

source: Currency
ru: Валюта

source: Calculator
ru: Калькулятор

source: Converter
ru: Конвертер

source: Gradians
ru: Грады

source: Word
ru: Слово

source: Byte
ru: Байт

source: Show this controls window
ru: Показать это окно параметров

source: Show Preferences
ru: Показать параметры

source: Add to Memory
ru: Прибавить к памяти

source: Subtract from Memory
ru: Вычесть из памяти

source: Recall from Memory
ru: Вызов из памяти

source: Clear Memory
ru: Очистка памяти

source: Last Answer
ru: Последний результат

source: Close Dialog
ru: Закрыть диалоговое окно

source: All Clear
ru: Очистить всё

source: Copy Result
ru: Скопировать результат

source: Paste Input Expression
ru: Вставить входное выражение

source: Square (root) a Number
ru: Квадрат(ный корень) числа

source: Raise to the power (or nth root over)
ru: Возвести в степень (или корень n-й степени)

source: 10 (or e) raised to the power
ru: 10 (или e), возведённая в степень

source: Log base 10 (or e)
ru: Логарифм по основанию 10 (или e)

source: (Inverse) Sine
ru: (Обратный) синус

source: (Inverse) Cosine
ru: (Обратный) косинус

source: (Inverse) Tangent
ru: (Обратный) тангенс

source: (Inverse) Hyperbolic Sine
ru: (Обратный) гиперболический синус

source: (Inverse) Hyperbolic Cosine
ru: (Обратный) гиперболический косинус

source: (Inverse) Hyperbolic Tangent
ru: (Обратный) гиперболический тангенс

source: Modulus or Log base x
ru: Модуль (или логарифм по основанию x)

source: Permutation or Combination
ru: Перестановки (или сочетания)

source: Factorial
ru: Факториал

source: Constants
ru: Вызов 1-й (2-й) константы

source: Result
ru: Результат

source: Logical OR or NOR
ru: Логическое ИЛИ (или ИЛИ-НЕ)

source: Logical AND or NAND
ru: Логическое И (или И-НЕ)

source: Logical XOR or XNOR
ru: Логическое XOR (или XOR-НЕ)

source: Logical NOT or Mod
ru: Логическое НЕ (или модуль)

source: Add Cell
ru: Добавить ячейку

source: Insert Cell
ru: Вставить ячейку

source: Next Cell or Add Right
ru: Следующая ячейка (или добавить справа)

source: Previous Cell or Add Left
ru: Предыдущая ячейка (или добавить слева)

source: Navigate Left
ru: Предыдущая ячейка

source: Navigate Right
ru: Следующая ячейка

source: Remove Cell
ru: Удалить ячейку

source: Remove All Cells (Reset)
ru: Удалить все ячейки (сброс)

source: Cardinality
ru: Мощность

source: Mode
ru: Мода

source: Median
ru: Медианное значение

source: Summation
ru: Статистическая сумма

source: Summation Squared
ru: Квадрат статистической суммы

source: Sample Variance
ru: Выборочная дисперсия

source: Mean
ru: Среднее значение

source: Mean Squared
ru: Квадрат среднего значения

source: Geometric Mean
ru: Среднее геометрическое

source: Sample Standard Deviation
ru: Среднеквадратическое отклонение

source: Population Variance
ru: Дисперсия населения

source: Population Standard Deviation
ru: Стандартное отклонение населения

source: Variable x
ru: Переменная x

source: Definite Integral
ru: Определённый интеграл

source: Derivative at a point
ru: Производная в точке

source: Interchange unit
ru: Поменять единицы местами

source: Update Forex Data (Currency converter)
ru: Обновить данные Forex (валюта)

source: Number of decimal places:
ru: Число знаков после запятой:

source: Integral Calculus Accuracy
ru: Точность исчисления интегралов

source: Fast
ru: Быстро

source: Accurate
ru: Точно

source: Scientific constants button:
ru: Константы в инженерном виде:

source: Constant 1
ru: Константа 1

source: Euler's constant (exponential)
ru: Постоянная Эйлера (экспонента)

source: Archimedes' constant (pi)
ru: Постоянная Архимеда (пи)

source: Parabolic constant
ru: Параболическая постоянная

source: Golden ratio (phi)
ru: Золотое сечение (фи)

source: Euler–Mascheroni constant (gamma)
ru: Постоянная Эйлера–Маскерони (гамма)

source: Conway's constant (lambda)
ru: Постоянная Конвея (лямбда)

source: Khinchin's constant
ru: Постоянная Хинчина

source: The Feigenbaum constant alpha
ru: Вторая константа Фейгенбаума (альфа)

source: The Feigenbaum constant delta
ru: Первая константа Фейгенбаума (дельта)

source: Apery's constant
ru: Постоянная Апери

source: Constant 2 (Hold Shift)
ru: Константа 2 (удерживайте Shift)

source: Currency Converter API Key
ru: API-ключ конвертера валют

source: Get your own API key
ru: Получить собственный API-ключ

source: Reset
ru: Сброс

source: Add
ru: Прибавить

source: Subtract
ru: Вычесть

source: Divide
ru: Разделить

source: Multiply
ru: Умножить

source: Last Result
ru: Последний результат

source: Pebbles Mini Mode
ru: Pebbles (уменьшенный вид)

source: Backspace
ru: Стереть

source: Variable for linear expressions
ru: Переменная для линейных выражений

source: x raised to the power y
ru: x в степени y

source: Add it to the value in Memory
ru: Прибавить к значению в памяти

source: Sine
ru: Синус

source: Hyperbolic Sine
ru: Гиперболический синус

source: Subtract it from the value in Memory
ru: Вычесть из значения в памяти

source: Cosine
ru: Косинус

source: Hyperbolic Cosine
ru: Гиперболический косинус

source: Modulus
ru: Модуль

source: Recall value from Memory
ru: Вызвать значение из памяти

source: Tangent
ru: Тангенс

source: Hyperbolic Tangent
ru: Гиперболический тангенс

source: Permutations
ru: Перестановки

source: Memory Clear
ru: Очистить память

source: Last answer
ru: Последний результат

source: Definite Integral (Upper limit 'u' and Lower limit 'l')
ru: Определённый интеграл (верхний предел «u» и нижний предел «l»)

source: Derivative (at a point x)
ru: Производная (в точке x)

source: Other functions, integration and differentiation
ru: Другие функции, интегрирование и дифференцирование

source: Access alternative functions
ru: Открыть дополнительные функции

source: nth root over number
ru: Корень n-й степени

source: Inverse Sine
ru: Обратный синус

source: Inverse Hyperbolic Sine
ru: Обратный гиперболический синус

source: Inverse Cosine
ru: Обратный косинус

source: Inverse Hyperbolic Cosine
ru: Обратный гиперболический косинус

source: Log base x
ru: Логарифм по основанию x

source: Inverse Tangent
ru: Обратный тангенс

source: Inverse Hyperbolic Tangent
ru: Обратный гиперболический тангенс

source: Combinations
ru: Сочетания

source: Parabolic constant (𝑃)
ru: Параболическая постоянная (𝑃)

source: Percentage
ru: Процент

source: Square a number
ru: Квадрат числа

source: 10 raised to the power x
ru: 10 в степени x

source: Log base 10
ru: Логарифм по основанию 10

source: Opens functions panel
ru: Открыть панель функций

source: Square root over number
ru: Квадратный корень числа

source: e raised to the power x
ru: e, возведённая в степень x

source: Natural Logarithm
ru: Натуральный логарифм

source: Bit toggle grid
ru: Сетка переключения битов

source: Left Shift
ru: Сдвиг влево

source: Logical OR (TRUE for any input being TRUE)
ru: Логическое ИЛИ (истинно, когда любой входной бит истинен)

source: Logical AND (TRUE for all inputs being TRUE)
ru: Логическое И (истинно, когда оба входных бита истинны)

source: Logical Exclusive-OR (TRUE for exactly one input being TRUE)
ru: Логическое XOR (истинно, когда только один из входных битов истинен)

source: Logical Inverter (TRUE for input being FALSE and vice versa)
ru: Логическое НЕ (истинно, когда входной бит ложен, и наоборот)

source: Logical NOT-of-OR (TRUE only for all inputs being FALSE)
ru: Логическое ИЛИ-НЕ (истинно, когда оба входных бита ложны)

source: Logical NOT-of-AND (FALSE only for all inputs being TRUE)
ru: Логическое И-НЕ (ложно, когда оба входных бита истинны)

source: Logical NOT-of-XOR (TRUE only for all inputs being same)
ru: Логическое XOR-НЕ (истинно, когда оба входных бита одинаковы)

source: Right Shift
ru: Сдвиг вправо

source: The Date was
ru: Этой датой был(-а)

source: The Date will be
ru: Этой датой будет

source: Find Difference
ru: Разница между датами

source: Infer Date
ru: Вычислить дату

source: From
ru: Между

source: To
ru: И

source: Difference
ru: Разница

source: Hey, it's the same date
ru: (это одна и та же дата!)

source: Starting from
ru: К исходной дате

source: Day
ru: Дни

source: Month
ru: Месяцы

source: Year
ru: Годы

source: Set a duration
ru: Установить продолжительность

source: Days, months or year
ru: Дней, месяцев или лет

source: Difference Between Dates
ru: Разница между датами

source: Add or Subtract Dates
ru: Прибавление или вычитание даты

source: day
ru: день

source: days
ru: дня/-ей

source: A total of %s
ru: , то есть %s

source: year
ru: год

source: years
ru: года/лет

source: and
ru: и

source: month
ru: месяц

source: months
ru: месяца/-ев

source: week
ru: неделя

source: weeks
ru: недели

source: counting backwards
ru: считая в обратном порядке

source: Monday
ru: Понедельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: Sunday
ru: Воскресенье

source: Clear sample
ru: Очистить выборку

source: Negative
ru: Обратное число

source: Navigate to the cell on the left
ru: Перейти к ячейке слева

source: Navigate to the cell on the right
ru: Перейти к ячейке справа

source: Left click: Add cell, Right click: Insert cell
ru: ЛКМ: Добавить ячейку, ПКМ: Вставить ячейку

source: Remove current cell
ru: Удалить текущую ячейку

source: Sample size
ru: Размер выборки

source: Mode of the sample data
ru: Мода выборки

source: Summation of all data values
ru: Сумма всех значений данных

source: Summation of all data values squared
ru: Квадрат суммы всех значений данных

source: Sample variance
ru: Выборочная дисперсия

source: Mean of squared data values
ru: Квадрат среднего всех значений данных

source: Standard deviation
ru: Среднеквадратическое отклонение

source: Memory Recall
ru: Вызов из памяти

source: Geometric mean
ru: Среднее геометрическое

source: Population standard deviation
ru: Стандартное отклонение населения

source: Query Result
ru: Результат запроса

source: Clear Entry
ru: Очистить запись

source: Nanometre
ru: Нанометры

source: Micron
ru: Микроны

source: Millimetre
ru: Миллиметры

source: Centimetre
ru: Сантиметры

source: Metre
ru: Метры

source: Kilometre
ru: Километры

source: Inch
ru: Дюймы

source: Foot
ru: Футы

source: Yard
ru: Ярды

source: Mile
ru: Мили

source: Nautical Mile
ru: Морские мили

source: Square millimetre
ru: Квадратные миллиметры

source: Square centimetre
ru: Квадратные сантиметры

source: Square metre
ru: Квадратные метры

source: Square kilometre
ru: Квадратные километры

source: Square inch
ru: Квадратные дюймы

source: Square foot
ru: Квадратные футы

source: Square yard
ru: Квадратные ярды

source: Hectare
ru: Гектары

source: Acre
ru: Акры

source: Square mile
ru: Квадратные мили

source: Millilitre
ru: Миллилитры

source: Cubic centimetre
ru: Кубические сантиметры

source: Litre
ru: Литры

source: Cubic metre
ru: Кубические метры

source: US teaspoon
ru: Чайные ложки (США)

source: US tablespoon
ru: Столовые ложки (США)

source: US fluid ounce
ru: Жидкие унции (США)

source: US legal cup
ru: Стаканы (США)

source: US pint
ru: Пинты (США)

source: US quart
ru: Кварты (США)

source: US gallon
ru: Галлоны (США)

source: Imperial teaspoon
ru: Чайные ложки (Великобритания)

source: Imperial tablespoon
ru: Столовые ложки (Великобритания)

source: Imperial fluid ounce
ru: Жидкие унции (Великобритания)

source: Imperial cup
ru: Чашки (Великобритания)

source: Imperial pint
ru: Пинты (Великобритания)

source: Imperial quart
ru: Кварты (Великобритания)

source: Imperial gallon
ru: Галлоны (Великобритания)

source: Cubic inch
ru: Кубические дюймы

source: Cubic foot
ru: Кубические футы

source: Cubic yard
ru: Кубические ярды

source: Microsecond
ru: Микросекунды

source: Millisecond
ru: Миллисекунды

source: Second
ru: Секунды

source: Minute
ru: Минуты

source: Hour
ru: Часы

source: Week
ru: Недели

source: Decade
ru: Декады

source: Century
ru: Столетия

source: Degree
ru: Градусы

source: Radian
ru: Радины

source: Gradian
ru: Грады

source: Milliradian
ru: Миллирадианы

source: Second of arc
ru: Секунды дуги (арксекунды)

source: Minute of arc
ru: Минуты дуги (аркминуты)

source: Centimetre per second
ru: Сантиметры в секунду

source: Metre per second
ru: Метры в секунду

source: Kilometre per hour
ru: Километры в час

source: Foot per second
ru: Футы в секунды

source: Miles per hour
ru: Мили в час

source: Knot
ru: Узлы

source: Mach
ru: Махи (скорость звука)

source: Atmosphere
ru: Атмосферы

source: Bar
ru: Бары

source: Millimetre of mercury
ru: Миллиметры ртутного столба

source: Pascal
ru: Паскали

source: Pound-force / sq-inch
ru: Фунт-сила на квадратный дюйм

source: Torr
ru: Торры

source: Microgram
ru: Микрограммы

source: Milligram
ru: Миллиграммы

source: Gram
ru: Граммы

source: Kilogram
ru: Килограммы

source: Tonne
ru: Тонны

source: US ton
ru: Тонны (США)

source: Imperial Ton
ru: Тонны (Великобритания)

source: Ounce
ru: Унции

source: Pound
ru: Фунты

source: Stone
ru: Стоуны

source: Joule
ru: Джоули

source: Kilojoule
ru: Килоджоули

source: Gram calorie
ru: Грамм-калории

source: Kilocalorie
ru: Килокалории

source: Watt hour
ru: Ватт-часы

source: Kilowatt hour
ru: Киловатт-часы

source: British thermal unit
ru: Британские тепловые единицы

source: US therm
ru: Американские термы

source: Foot-pound
ru: Фут-фунты

source: Watt
ru: Ватты

source: Kilowatt
ru: Киловатты

source: Metric horsepower
ru: Лошадиные силы (метрические)

source: Mechanical horsepower
ru: Лошадиные силы (механические)

source: Foot-pound / minute
ru: Фут-фунты в минуту

source: BTU / hour
ru: Британские тепловые единицы в час

source: Celsius
ru: Градусы Цельсия

source: Fahrenheit
ru: Градусы Фаренгейта

source: Kelvin
ru: Кельвины

source: Bit
ru: Бит

source: Kilobit
ru: Килобит

source: Kibibit
ru: Кибибит

source: Megabit
ru: Мегабит

source: Mebibit
ru: Мебибит

source: Gigabit
ru: Гигабит

source: Gibibit
ru: Гибибит

source: Terabit
ru: Терабит

source: Tebibit
ru: Тебибит

source: Petabit
ru: Петабит

source: Pebibit
ru: Пебибит

source: Kilobyte
ru: Килобайт

source: Kibibyte
ru: Кибибайт

source: Megabyte
ru: Мегабайт

source: Mebibyte
ru: Мебибайт

source: Gigabyte
ru: Гигабайт

source: Gibibyte
ru: Гибибайт

source: Terabyte
ru: Терабайт

source: Tebibyte
ru: Тебибайт

source: Petabyte
ru: Петабайт

source: Pebibyte
ru: Пебибайт

source: US Dollar
ru: Доллары США

source: Euro
ru: Евро

source: British Pounds
ru: Британские фунты

source: Australian Dollar
ru: Австралийские доллары

source: Brazilian Real
ru: Бразильские реалы

source: Canadian Dollar
ru: Канадские доллары

source: Chinese Yuan
ru: Китайские юани

source: Indian Rupee
ru: Индийские рупии

source: Japanese Yen
ru: Японские иены

source: Russian Ruble
ru: Российские рубли

source: South African Rand
ru: Южноафриканские рэнды

source: Failed to update forex data!
ru: Не удалось обновить данные Forex!

source: Updating foreign exchange data
ru: Обновление курсов валют…

source: Common
ru: Общие

source: Unit Converters
ru: Конвертеры величин

source: Pebbles Controls
ru: Сочетания клавиш Pebbles

source: Double click to recall, Right click to insert
ru: Двойной клик для вызова, ПКМ для вставки

source: Clear history
ru: Очистить историю

source: Input Expression
ru: Входное выражение

source: Type
ru: Тип

source: Integral
ru: Интеграл

source: Derivative
ru: Производная

source: Enter data by adding new cell
ru: Введите данные, добавив новую ячейку

source: Thread support missing. Please wait for web API access…
ru: Отсутствует поддержка потоков. Пожалуйста, дождитесь ответа API…

source: Failed to connect to currency exchange service
ru: Не удалось подключиться к сервису обмена валют

source: Failed to connect to service: %s
ru: Не удалось подключиться к сервису: %s
